const INGREDIENTS_DATA = [
    {
        name: "草魚",
        rarity: "rare-white",
        rarityText: "普通",
        image: "ingredients/草魚.png",
        description: "習性:草食性淡水魚\n一種比較常見的草食魚類，生殖能力和繁殖能力都超強。",
        source: "營地魚塘、多貝雪山、亞述丘陵、晴空麥田、聖誕村、密斯卡鎮、大河區、灰熊山、狩狼野、雙路市、沼澤邊境、沉寂平原、黑珍珠區、維納雪場、遠星城、沙石堡、茅斯沼澤、紅杉鎮"
    },
    {
        name: "明蝦",
        rarity: "rare-white",
        rarityText: "普通",
        image: "ingredients/明蝦.png",
        description: "一種很常見的蝦類，可以用來烹飪，也可以做成魚餌來釣龍蝦。",
        source: "營地魚塘、多貝雪山、亞述丘陵、晴空麥田、聖誕村、大河區、灰熊山、雙路市、沼澤邊境、沉寂平原、維納雪場、遠星城、沙石堡、茅斯沼澤、紅杉鎮"
    },
    {
        name: "河蟹",
        rarity: "rare-white",
        rarityText: "普通",
        image: "ingredients/河蟹.png",
        description: "生命力極強的一種螃蟹，常見於河底，可用於烹飪。",
        source: "營地魚塘、夏爾鎮、銀翼基地、加泰林地、紅水湖、鬼影山、荒土曠野、殘垣戈壁、烏茨礦場、極地冰原、夏雨公路、白樹高地、秋日森林"
    },
    {
        name: "鯉魚",
        rarity: "rare-green",
        rarityText: "珍稀",
        image: "ingredients/鯉魚.png",
        description: "習性:雜食性淡水魚\n一種非常漂亮的魚，有人說它代表著幸運，可用於烹飪。",
        source: "營地魚塘、夏爾鎮、多貝雪山、銀翼基地、亞述丘陵、晴空麥田、聖誕村、加泰林地、密斯卡鎮、大河區、灰熊山、狩狼野、紅水湖、雙路市、鬼影山、沼澤邊境、沉寂平原、荒土曠野、殘垣戈壁、烏茨礦場、黑珍珠區、極地冰原、夏雨公路、維納雪場、白樹高地、遠星城、秋日森林、萊文黎明區、沙石堡、茅斯沼澤、萊文市、紅杉鎮"
    },
    {
        name: "河豚",
        rarity: "rare-blue",
        rarityText: "貴重",
        image: "ingredients/河豚.png",
        description: "習性:雜食性淡水魚\n一種很容易「生氣」的魚，同時也是一種很美味的魚，如果不怕中毒的話。",
        source: "營地魚塘、夏爾鎮郊、銀翼基地、加泰林地、灰熊山、紅水湖、雙路市、鬼影山、沉寂平原、荒土曠野、殘垣戈壁、烏茨礦場、極地冰原、夏雨公路、白樹高地、遠星城、秋日森林、沙石堡、紅杉鎮"
    },
    {
        name: "鯰魚",
        rarity: "rare-white",
        rarityText: "普通",
        image: "ingredients/鯰魚.png",
        description: "習性:肉食性淡水魚\n一種長鬍鬚的魚，肉食性，生長速度極快，可用於烹飪。",
        source: "營地魚塘、夏爾鎮、銀翼基地、加泰林地、紅水湖、鬼影山、荒土曠野、殘垣戈壁、烏茨礦場、極地冰原、夏雨公路、白樹高地、秋日森林、萊文黎明區、萊文市"
    },
    {
        name: "鱖魚",
        rarity: "rare-green",
        rarityText: "珍稀",
        image: "ingredients/鱖魚.png",
        description: "習性:肉食性淡水魚\n一種兇猛肉食性魚類，常以其他魚類為食，鱖魚肉質肥美，非常適合烹飪。",
        source: "春季\n夏爾鎮、多貝雪山、銀翼基地、亞述丘陵、晴空麥田、聖誕村、加泰林地、密斯卡鎮、大河區、灰熊山、狩狼野、紅水湖、雙路市、鬼影山、沼澤邊境、沉寂平原、荒土曠野、殘垣戈壁、烏茨礦場、黑珍珠區、極地冰原、夏雨公路、維納雪場、白樹高地、遠星城、秋日森林、沙石堡、茅斯沼澤、紅杉鎮"
    },
    {
        name: "紅羅非魚",
        rarity: "rare-blue",
        rarityText: "貴重",
        image: "ingredients/紅羅非魚.png",
        description: "習性:雜食性淡水魚\n紅羅非魚，身體具美麗的微紅色和銀色小斑點，營養價值極高，可用於烹飪。",
        source: "營地魚塘、多貝雪山、亞述丘陵、晴空麥田、聖誕村、密斯卡鎮、大河區、狩狼野、沼澤邊境、黑珍珠區、夏雨公路、維納雪場、白樹高地、秋日森林、萊文黎明區、茅斯沼澤、萊文市"
    }
];
